import { ref, type Ref } from 'vue'
import type { Cell } from './useBoard'

// prettier-ignore
export const blinker = Object.freeze([
  '⚪⚪⚪⚪⚪',
  '⚪⚪🔴⚪⚪',
  '⚪⚪🔴⚪⚪',
  '⚪⚪🔴⚪⚪',
  '⚪⚪⚪⚪⚪',
])

// prettier-ignore
export const toad = Object.freeze([
  '⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪',
  '⚪⚪🔴🔴🔴⚪',
  '⚪🔴🔴🔴⚪⚪',
  '⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪',
])

// prettier-ignore
export const beacon = Object.freeze([
  '⚪⚪⚪⚪⚪⚪',
  '⚪🔴🔴⚪⚪⚪',
  '⚪🔴🔴⚪⚪⚪',
  '⚪⚪⚪🔴🔴⚪',
  '⚪⚪⚪🔴🔴⚪',
  '⚪⚪⚪⚪⚪⚪',
])

// prettier-ignore
export const pulsar = Object.freeze([
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪🔴🔴🔴⚪⚪⚪🔴🔴🔴⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪🔴⚪⚪⚪⚪🔴⚪🔴⚪⚪⚪⚪🔴⚪',
  '⚪🔴⚪⚪⚪⚪🔴⚪🔴⚪⚪⚪⚪🔴⚪',
  '⚪🔴⚪⚪⚪⚪🔴⚪🔴⚪⚪⚪⚪🔴⚪',
  '⚪⚪⚪🔴🔴🔴⚪⚪⚪🔴🔴🔴⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪🔴🔴🔴⚪⚪⚪🔴🔴🔴⚪⚪⚪',
  '⚪🔴⚪⚪⚪⚪🔴⚪🔴⚪⚪⚪⚪🔴⚪',
  '⚪🔴⚪⚪⚪⚪🔴⚪🔴⚪⚪⚪⚪🔴⚪',
  '⚪🔴⚪⚪⚪⚪🔴⚪🔴⚪⚪⚪⚪🔴⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪🔴🔴🔴⚪⚪⚪🔴🔴🔴⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
])

// prettier-ignore
export const pentadecathlon = Object.freeze([
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪🔴⚪⚪🔴⚪🔴🔴⚪🔴⚪⚪🔴⚪⚪',
  '⚪⚪🔴🔴🔴🔴⚪🔴🔴⚪🔴🔴🔴🔴⚪⚪',
  '⚪⚪🔴⚪⚪🔴⚪🔴🔴⚪🔴⚪⚪🔴⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
])

// prettier-ignore
export const aforall = Object.freeze([
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪🔴🔴⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪🔴⚪⚪🔴⚪⚪⚪⚪',
  '⚪⚪⚪⚪🔴🔴🔴🔴⚪⚪⚪⚪',
  '⚪⚪🔴⚪🔴⚪⚪🔴⚪🔴⚪⚪',
  '⚪🔴⚪⚪⚪⚪⚪⚪⚪⚪🔴⚪',
  '⚪🔴⚪⚪⚪⚪⚪⚪⚪⚪🔴⚪',
  '⚪⚪🔴⚪🔴⚪⚪🔴⚪🔴⚪⚪',
  '⚪⚪⚪⚪🔴🔴🔴🔴⚪⚪⚪⚪',
  '⚪⚪⚪⚪🔴⚪⚪🔴⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪🔴🔴⚪⚪⚪⚪⚪',
  '⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪',
])

// prettier-ignore
export const block = Object.freeze([
  '⚪⚪⚪⚪',
  '⚪🔴🔴⚪',
  '⚪🔴🔴⚪',
  '⚪⚪⚪⚪',
])

// prettier-ignore
export const beehive = Object.freeze([
  '⚪⚪⚪⚪⚪⚪',
  '⚪⚪🔴🔴⚪⚪',
  '⚪🔴⚪⚪🔴⚪',
  '⚪⚪🔴🔴⚪⚪',
  '⚪⚪⚪⚪⚪⚪',
])

export const loaf = Object.freeze([
  '⚪⚪⚪⚪⚪⚪',
  '⚪⚪🔴🔴⚪⚪',
  '⚪🔴⚪⚪🔴⚪',
  '⚪⚪🔴⚪🔴⚪',
  '⚪⚪⚪🔴⚪⚪',
  '⚪⚪⚪⚪⚪⚪',
])

// prettier-ignore
export const boat = Object.freeze([
  '⚪⚪⚪⚪⚪',
  '⚪🔴🔴⚪⚪',
  '⚪🔴⚪🔴⚪',
  '⚪⚪🔴⚪⚪',
  '⚪⚪⚪⚪⚪',
])

// prettier-ignore
export const tub = Object.freeze([
  '⚪⚪⚪⚪⚪',
  '⚪⚪🔴⚪⚪',
  '⚪🔴⚪🔴⚪',
  '⚪⚪🔴⚪⚪',
  '⚪⚪⚪⚪⚪',
])

export function toCells(emojiGrid: readonly string[]): Ref<Cell[][]> {
  const grid = emojiGrid.map((row, rowIndex) => {
    const cols = [...row]
    return cols.map((col, colIndex) => {
      const cell: Cell = {
        row: rowIndex,
        col: colIndex,
        state: col !== '⚪',
      }
      return cell
    })
  })
  return ref(grid)
}
